package test2;
/*
 * 날짜: 2023/06/15
 * 이름: 강윤수
 * 내용: 자바 배열 선택정렬 연습문제
 * 
 * 선택정렬
 * 	- 알고리즘에서 배열의 원소를 정렬하는 가장 기본적인 방법
 * 	- 정렬 알고리즘에는 선택정렬, 삽입정렬, 퀵정렬, 버블정렬 등이 있다.
 * 
 * 정렬단계
 * 	1단계 :	배열의 첫번째 원소를 2, 3, 4, 5번째 원소와 차례로 비교
 *  2단계 :	첫번째 원소보다 작은 원소를 찾으면 서로 자리 교환
 *  3단계 :	배열의 두번째 원소를 3, 4, 5번째 원소와 차례로 비교
 *  4단계 :	두번째 원소보다 작은 원소를 찾으면 서로 자리 교환
 *  5단계 :	위와 같이 최종 숫자가 하나 남을 때까지 반복 수행
 */
public class Test04 {

	public static void main(String[] args) {
		
		int arr[] = {4, 2, 1, 5, 3};
		
		for(int i = 0; i < 4; i++) {  			// i는 0이다. i가 4보다 작으면 아래로 내려간다
			
			for(int j = i + 1; j < 5; j++) {	// j는 0+1이다. j가 5보다 작으면 아래로 내려간다
				
				if(arr[i] > arr[j]) {			// 만약 arr[0]이 arr[1]보다 크면 아래의 식을 실행한다
					int temp = arr[j];			// temp는 arr[1]이다
					arr[j] = arr[i];			// arr[1]은 arr[0]이다
					arr[i] = temp;				// arr[0]은 arr[1]이다
				}
			}
		}
		
		//정렬된 배열 출력하기
		for(int n = arr[0] ; n <= 5 ; n++) {	// (int n : arr)
			System.out.print(n+" ");
		}
	}
}

//1: 2, 4, 1, 5, 3
//2: 1, 4, 2, 5, 3
//3: 1보다 더 작은게 없으니 고정
//4: 1, 4, 2, 5, 3
//5: 1, 2, 4, 5, 3 
//6: 2보다 더 작은게 없으니 고정
//7: 1, 2, 5, 4, 3
//8: 1, 2, 